<?php
/*
 * Заполнение таблицы МКБ-10
 * */

namespace console\controllers;


use common\models\DentistrySection;
use yii\console\Controller;
use common\modules\patient\models\Diagnosis as Diagnosis;
use common\models\Classification;


class FillMkb10Controller extends Controller
{
    const CLASSIFFICATION_NAME='БОЛЕЗНИ ПОЛОСТИ РТА, СЛЮННЫХ ЖЕЛЕЗ И ЧЕЛЮСТЕЙ (K00-K14)';
    const SECTION_NAME='МКБ-10';

    public $itemsMkb10 = [
        ['id' => '4527', 'Nazv' => 'Нарушения развития и прорезывания зубов', 'upID' => '0', 'Cat' => '1', 'code' => 'K00',],
        ['id' => '4528', 'Nazv' => 'Адентия', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.0',],
        ['id' => '4529', 'Nazv' => 'Сверхкомплектные зубы', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.1',],
        ['id' => '4530', 'Nazv' => 'Аномалии размеров и формы зубов', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.2',],
        ['id' => '4531', 'Nazv' => 'Крапчатые зубы', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.3',],
        ['id' => '4532', 'Nazv' => 'Нарушения формирования зубов', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.4',],
        ['id' => '4533', 'Nazv' => 'Наследственные нарушения структуры зуба, не классифицированные в других рубриках', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.5',],
        ['id' => '4534', 'Nazv' => 'Нарушения прорезывания зубов', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.6',],
        ['id' => '4535', 'Nazv' => 'Синдром прорезывания зубов', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.7',],
        ['id' => '4536', 'Nazv' => 'Другие нарушения развития зубов', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.8',],
        ['id' => '4537', 'Nazv' => 'Нарушение развития зубов неуточненное', 'upID' => '4527', 'Cat' => '0', 'code' => 'K00.9',],
        ['id' => '4538', 'Nazv' => 'Ретенированные и импактные зубы', 'upID' => '0', 'Cat' => '1', 'code' => 'K01',],
        ['id' => '4539', 'Nazv' => 'Ретенированные зубы', 'upID' => '4538', 'Cat' => '0', 'code' => 'K01.0',],
        ['id' => '4540', 'Nazv' => 'Импактные зубы', 'upID' => '4538', 'Cat' => '0', 'code' => 'K01.1',],
        ['id' => '4541', 'Nazv' => 'Кариес зубов', 'upID' => '0', 'Cat' => '1', 'code' => 'K02',],
        ['id' => '4542', 'Nazv' => 'Кариес эмали', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.0',],
        ['id' => '4543', 'Nazv' => 'Кариес дентина', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.1',],
        ['id' => '4544', 'Nazv' => 'Кариес цемента', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.2',],
        ['id' => '4545', 'Nazv' => 'Приостановившийся кариес зубов', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.3',],
        ['id' => '4546', 'Nazv' => 'Одонтоклазия', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.4',],
        ['id' => '14854', 'Nazv' => 'Кариес с вскрытием пульпы', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.5',],
        ['id' => '4547', 'Nazv' => 'Другой кариес зубов', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.8',],
        ['id' => '4548', 'Nazv' => 'Кариес зубов неуточненный', 'upID' => '4541', 'Cat' => '0', 'code' => 'K02.9',],
        ['id' => '4549', 'Nazv' => 'Другие болезни твердых тканей зубов', 'upID' => '0', 'Cat' => '1', 'code' => 'K03',],
        ['id' => '4550', 'Nazv' => 'Повышенное стирание зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.0',],
        ['id' => '4551', 'Nazv' => 'Сошлифовывание зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.1',],
        ['id' => '4552', 'Nazv' => 'Эрозия зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.2',],
        ['id' => '4553', 'Nazv' => 'Патологическая резорбция зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.3',],
        ['id' => '4554', 'Nazv' => 'Гиперцементоз', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.4',],
        ['id' => '4555', 'Nazv' => 'Анкилоз зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.5',],
        ['id' => '4556', 'Nazv' => 'Отложения [наросты] на зубах', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.6',],
        ['id' => '4557', 'Nazv' => 'Изменение цвета твердых тканей зубов после прорезывания', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.7',],
        ['id' => '4558', 'Nazv' => 'Другие уточненные болезни твердых тканей зубов', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.8',],
        ['id' => '4559', 'Nazv' => 'Болезнь твердых тканей зубов неуточненная', 'upID' => '4549', 'Cat' => '0', 'code' => 'K03.9',],
        ['id' => '4560', 'Nazv' => 'Болезни пульпы и периапикальных тканей', 'upID' => '0', 'Cat' => '1', 'code' => 'K04',],
        ['id' => '4561', 'Nazv' => 'Пульпит', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.0',],
        ['id' => '4562', 'Nazv' => 'Некроз пульпы', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.1',],
        ['id' => '4563', 'Nazv' => 'Дегенерация пульпы', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.2',],
        ['id' => '4564', 'Nazv' => 'Неправильное формирование твердых тканей в пульпе', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.3',],
        ['id' => '4565', 'Nazv' => 'Острый апикальный периодонтит пульпарного происхождения', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.4',],
        ['id' => '4566', 'Nazv' => 'Хронический апикальный периодонтит', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.5',],
        ['id' => '4567', 'Nazv' => 'Периапикальный абсцесс с полостью', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.6',],
        ['id' => '4568', 'Nazv' => 'Периапикальный абсцесс без полости', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.7',],
        ['id' => '4569', 'Nazv' => 'Корневая киста', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.8',],
        ['id' => '4570', 'Nazv' => 'Другие и неуточненные болезни пульпы и периапикальных тканей', 'upID' => '4560', 'Cat' => '0', 'code' => 'K04.9',],
        ['id' => '4571', 'Nazv' => 'Гингивит и болезни пародонта', 'upID' => '0', 'Cat' => '1', 'code' => 'K05',],
        ['id' => '4572', 'Nazv' => 'Острый гингивит', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.0',],
        ['id' => '4573', 'Nazv' => 'Хронический гингивит', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.1',],
        ['id' => '4574', 'Nazv' => 'Острый периодонтит', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.2',],
        ['id' => '4575', 'Nazv' => 'Хронический пародонтит', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.3',],
        ['id' => '4576', 'Nazv' => 'Пародонтоз', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.4',],
        ['id' => '4577', 'Nazv' => 'Другие болезни пародонта', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.5',],
        ['id' => '4578', 'Nazv' => 'Болезнь пародонта неуточненная', 'upID' => '4571', 'Cat' => '0', 'code' => 'K05.6',],
        ['id' => '4579', 'Nazv' => 'Другие изменения десны и беззубого альвеолярного края', 'upID' => '0', 'Cat' => '1', 'code' => 'K06',],
        ['id' => '4580', 'Nazv' => 'Рецессия десны', 'upID' => '4579', 'Cat' => '0', 'code' => 'K06.0',],
        ['id' => '4581', 'Nazv' => 'Гипертрофия десны', 'upID' => '4579', 'Cat' => '0', 'code' => 'K06.1',],
        ['id' => '4582', 'Nazv' => 'Поражения десны и беззубого альвеолярного края, обусловленные травмой', 'upID' => '4579', 'Cat' => '0', 'code' => 'K06.2',],
        ['id' => '4583', 'Nazv' => 'Другие уточненные изменения десны и беззубого альвеолярного края', 'upID' => '4579', 'Cat' => '0', 'code' => 'K06.8',],
        ['id' => '4584', 'Nazv' => 'Изменение десны и беззубого альвеолярного края неуточненное', 'upID' => '4579', 'Cat' => '0', 'code' => 'K06.9',],
        ['id' => '4585', 'Nazv' => 'Челюстно-лицевые аномалии [включая аномалии прикуса]', 'upID' => '0', 'Cat' => '1', 'code' => 'K07',],
        ['id' => '4586', 'Nazv' => 'Основные аномалии размеров челюстей', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.0',],
        ['id' => '4587', 'Nazv' => 'Аномалии челюстно-черепных соотношений', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.1',],
        ['id' => '4588', 'Nazv' => 'Аномалии соотношений зубных дуг', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.2',],
        ['id' => '4589', 'Nazv' => 'Аномалии положения зубов', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.3',],
        ['id' => '4590', 'Nazv' => 'Аномалия прикуса неуточненная', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.4',],
        ['id' => '4591', 'Nazv' => 'Челюстно-лицевые аномалии функционального происхождения', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.5',],
        ['id' => '4592', 'Nazv' => 'Болезни височно-нижнечелюстного сустава', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.6',],
        ['id' => '4593', 'Nazv' => 'Другие челюстно-лицевые аномалии', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.8',],
        ['id' => '4594', 'Nazv' => 'Челюстно-лицевая аномалия неуточненная', 'upID' => '4585', 'Cat' => '0', 'code' => 'K07.9',],
        ['id' => '4595', 'Nazv' => 'Другие изменения зубов и их опорного аппарата', 'upID' => '0', 'Cat' => '1', 'code' => 'K08',],
        ['id' => '4596', 'Nazv' => 'Эксфолиация зубов вследствие системных нарушений', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.0',],
        ['id' => '4597', 'Nazv' => 'Потеря зубов вследствие несчастного случая, удаления или локальной периодонтальной болезни', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.1',],
        ['id' => '4598', 'Nazv' => 'Атрофия беззубого альвеолярного края', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.2',],
        ['id' => '4599', 'Nazv' => 'Задержка зубного корня [ретенционный корень]', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.3',],
        ['id' => '4600', 'Nazv' => 'Другие уточненные изменения зубов и их опорного аппарата', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.8',],
        ['id' => '4601', 'Nazv' => 'Изменение зубов и их опорного аппарата неуточненное', 'upID' => '4595', 'Cat' => '0', 'code' => 'K08.9',],
        ['id' => '4602', 'Nazv' => 'Кисты области рта, не классифицированные в других рубриках', 'upID' => '0', 'Cat' => '1', 'code' => 'K09',],
        ['id' => '4603', 'Nazv' => 'Кисты, образовавшиеся в процессе формирования зубов', 'upID' => '4602', 'Cat' => '0', 'code' => 'K09.0',],
        ['id' => '4604', 'Nazv' => 'Ростовые (неодонтогенные) кисты области рта', 'upID' => '4602', 'Cat' => '0', 'code' => 'K09.1',],
        ['id' => '4605', 'Nazv' => 'Другие кисты челюстей', 'upID' => '4602', 'Cat' => '0', 'code' => 'K09.2',],
        ['id' => '4606', 'Nazv' => 'Другие уточненные кисты области рта, не классифицированные в других рубриках', 'upID' => '4602', 'Cat' => '0', 'code' => 'K09.8',],
        ['id' => '4607', 'Nazv' => 'Киста области рта неуточненная', 'upID' => '4602', 'Cat' => '0', 'code' => 'K09.9',],
        ['id' => '4608', 'Nazv' => 'Другие болезни челюстей', 'upID' => '0', 'Cat' => '1', 'code' => 'K10',],
        ['id' => '4609', 'Nazv' => 'Нарушения развития челюстей', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.0',],
        ['id' => '4610', 'Nazv' => 'Гигантоклеточная гранулема центральная', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.1',],
        ['id' => '4611', 'Nazv' => 'Воспалительные заболевания челюстей', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.2',],
        ['id' => '4612', 'Nazv' => 'Альвеолит челюстей', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.3',],
        ['id' => '4613', 'Nazv' => 'Другие уточненные болезни челюстей', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.8',],
        ['id' => '4614', 'Nazv' => 'Болезнь челюсти неуточненная', 'upID' => '4608', 'Cat' => '0', 'code' => 'K10.9',],
        ['id' => '4615', 'Nazv' => 'Болезни слюнных желез', 'upID' => '0', 'Cat' => '1', 'code' => 'K11',],
        ['id' => '4616', 'Nazv' => 'Атрофия слюнной железы', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.0',],
        ['id' => '4617', 'Nazv' => 'Гипертрофия слюнной железы', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.1',],
        ['id' => '4618', 'Nazv' => 'Сиалоаденит', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.2',],
        ['id' => '4619', 'Nazv' => 'Абсцесс слюнной железы', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.3',],
        ['id' => '4620', 'Nazv' => 'Свищ слюнной железы', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.4',],
        ['id' => '4621', 'Nazv' => 'Сиалолитиаз', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.5',],
        ['id' => '4622', 'Nazv' => 'Мукоцеле слюнной железы', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.6',],
        ['id' => '4623', 'Nazv' => 'Нарушения секреции слюнных желез', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.7',],
        ['id' => '4624', 'Nazv' => 'Другие болезни слюнных желез', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.8',],
        ['id' => '4625', 'Nazv' => 'Болезнь слюнной железы неуточненная', 'upID' => '4615', 'Cat' => '0', 'code' => 'K11.9',],
        ['id' => '4626', 'Nazv' => 'Стоматит и родственные поражения', 'upID' => '0', 'Cat' => '1', 'code' => 'K12',],
        ['id' => '4627', 'Nazv' => 'Рецидивирующие афты полости рта', 'upID' => '4626', 'Cat' => '0', 'code' => 'K12.0',],
        ['id' => '4628', 'Nazv' => 'Другие формы стоматита', 'upID' => '4626', 'Cat' => '0', 'code' => 'K12.1',],
        ['id' => '4629', 'Nazv' => 'Флегмона и абсцесс области рта', 'upID' => '4626', 'Cat' => '0', 'code' => 'K12.2',],
        ['id' => '14855', 'Nazv' => 'Воспаление слизистой оболочки рта (язвенное)', 'upID' => '4626', 'Cat' => '0', 'code' => 'K12.3',],
        ['id' => '4630', 'Nazv' => 'Другие болезни губ и слизистой оболочки полости рта', 'upID' => '0', 'Cat' => '1', 'code' => 'K13',],
        ['id' => '4631', 'Nazv' => 'Болезни губ', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.0',],
        ['id' => '4632', 'Nazv' => 'Прикусывание щеки и губ', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.1',],
        ['id' => '4633', 'Nazv' => 'Лейкоплакия и другие изменения эпителия полости рта, включая язык', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.2',],
        ['id' => '4634', 'Nazv' => 'Волосатая лейкоплакия', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.3',],
        ['id' => '4635', 'Nazv' => 'Гранулема и гранулемоподобные поражения слизистой оболочки полости рта', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.4',],
        ['id' => '4636', 'Nazv' => 'Подслизистый фиброз полости рта', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.5',],
        ['id' => '4637', 'Nazv' => 'Гиперплазия слизистой оболочки полости рта вследствие раздражения', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.6',],
        ['id' => '4638', 'Nazv' => 'Другие и неуточненные поражения слизистой оболочки полости рта', 'upID' => '4630', 'Cat' => '0', 'code' => 'K13.7',],
        ['id' => '4639', 'Nazv' => 'Болезни языка', 'upID' => '0', 'Cat' => '1', 'code' => 'K14',],
        ['id' => '4640', 'Nazv' => 'Глоссит', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.0',],
        ['id' => '4641', 'Nazv' => '"Географический" язык', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.1',],
        ['id' => '4642', 'Nazv' => 'Срединный ромбовидный глоссит', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.2',],
        ['id' => '4643', 'Nazv' => 'Гипертрофия сосочков языка', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.3',],
        ['id' => '4644', 'Nazv' => 'Атрофия сосочков языка', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.4',],
        ['id' => '4645', 'Nazv' => 'Складчатый язык', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.5',],
        ['id' => '4646', 'Nazv' => 'Глоссодиния', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.6',],
        ['id' => '4647', 'Nazv' => 'Другие болезни языка', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.8',],
        ['id' => '4648', 'Nazv' => 'Болезнь языка неуточненная', 'upID' => '4639', 'Cat' => '0', 'code' => 'K14.9',],
    ];



    private $class_id;
    private $section_id;
    public function actionFill()
    {
        echo "Заполнение таблицы диагнозов мкб 10 в плане лечения...";
        $this->section_id=$this->createSection(self::SECTION_NAME);
        $this->class_id=$this->createClassification(self::CLASSIFFICATION_NAME,$this->section_id);

        foreach ($this->itemsMkb10 as $keyCat=>$itemCat){
            if ($itemCat['Cat']){//Создаём категорию
                $diagnosis= new Diagnosis();
                $diagnosis->Nazv=$itemCat['Nazv'];
                $diagnosis->upID=0;
                $diagnosis->Cat=1;
                $diagnosis->KlassID=$this->class_id;
                $diagnosis->code=$itemCat['code'];
                $diagnosis->save(false);
                $this->createItems($diagnosis->id,$itemCat['id']);

            }
        }
        echo "Выполнено.".PHP_EOL;
    }
    private function createClassification($name,$razd){

            $Classification=new Classification();

            $Classification->Nazv=$name;
            $Classification->Razd=$razd;

            $Classification->save(false);

            return $Classification->id;


    }
    private function createSection($name){
        $section=new DentistrySection();
        $section->Razd=$name;
        $section->save(false);

        return $section->id;
    }
    private function createItems($upID,$itemCatId){
        foreach ($this->itemsMkb10 as $key=>$item){
            if($item['upID']==$itemCatId){

                $diagnosis= new Diagnosis();
                $diagnosis->Nazv=$item['Nazv'];
                $diagnosis->upID=$upID;
                $diagnosis->Cat=0;
                $diagnosis->KlassID=$this->class_id;
                $diagnosis->code=$item['code'];
                $diagnosis->save(false);

            }


        }
    }
}